# 7장 데이터 준비하기: 다듬기, 변형, 병합
## 데이터 변형

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

___
## 1. 중복 제거하기

In [2]:
data = DataFrame({'k1': ['one']*3 + ['two']*4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [3]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

- 상기 메서드는 모든 칼럼에 적용

In [7]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [10]:
data.drop_duplicates()

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [8]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [12]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [11]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

- keep = 'last'로 처음 값 대신 마지막 값 유지
___
## 2. 함수나 매핑 이용해 데이터 변형하기

In [13]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [20]:
meat_to_animal = {'bacon': 'pig',
                 'pulled pork': 'pig',
                 'pastrami': 'cow',
                 'corned beef': 'cow',
                 'honey ham': 'pig',
                 'nova lox': 'salmon'}
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [21]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

- Series의 map 메서드는 사전류의 객체나 함수를 받을 수 있음
- 소문자로 변경 함수 > meat_to_animal과 매핑

In [25]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

- 위와 같이 lambda 함수를 사용해도 결과는 같음
___
## 3. 값 치환하기

In [27]:
data = Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [28]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

- replace 메서드로 특정 값을 원하는 값으로 치환

In [29]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [30]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [31]:
data.replace({-999: np.nan, -10000: 0})

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

- 복수의 값 치환도 가능
- 리스트나 딕셔너리 형대로 복수의 원하는 값 지정도 가능
___
## 4. 축 색인 이름 바꾸기

In [34]:
data = DataFrame(np.arange(12).reshape(3,4),
                index = ['Ohio', 'Colorado', 'New York'],
                columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [38]:
data.index = data.index.map(str.upper)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

- Series와 마찬가지로 축 색인에도 map 메서드 사용 가능

In [39]:
data.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

- str.title은 대문자/소문자 혼용해서 단어 표기

In [42]:
data.rename(index = {'Ohio': 'Indiana'},
            columns = {'three': 'peekaboo'})

          one  two  peekaboo  four
OHIO        0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

- 딕셔너리 활용해서 원하는 값만 수정하는 것도 가능

In [44]:
_ = data.rename(index = {'OHIO': 'Indiana'}, inplace = True)
data

          one  two  three  four
Indiana     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

- inplace = True 옵션으로 바로 원본 데이터를 수정
___
## 5. 개별화와 양자화
- 연속성 데이터는 분석을 위해 그룹별로 나누기도 하며, pandas에서 해당 기능 제공

In [46]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25 ,35 ,60 ,100]

In [48]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

- Pandas의 categorical 객체를 반환

In [50]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [51]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [53]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

- 상기 객체는 그룹 이름이 담긴 배열과 유사
- R의 factor와 유사

In [54]:
pd.cut(ages, bins, right = False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

- right = False 옵션으로 대괄호와 괄호 위치 변경 가능
- 대괄호는 포함, 괄호는 포함하지 않음

In [55]:
group_names = ['Youth', 'Young_Adult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels= group_names)

[Youth, Youth, Youth, Young_Adult, Youth, ..., Young_Adult, Senior, MiddleAged, MiddleAged, Young_Adult]
Length: 12
Categories (4, object): [Youth < Young_Adult < MiddleAged < Senior]

- Category 이름 지정도 가능 **(R의 Factor와 유사!)**

In [58]:
pd.cut(ages, 4, precision= 0)

[(20.0, 30.0], (20.0, 30.0], (20.0, 30.0], (20.0, 30.0], (20.0, 30.0], ..., (30.0, 40.0], (51.0, 61.0], (40.0, 51.0], (40.0, 51.0], (30.0, 40.0]]
Length: 12
Categories (4, interval[float64]): [(20.0, 30.0] < (30.0, 40.0] < (40.0, 51.0] < (51.0, 61.0]]

- 범위를 명시하지 않고 구간 수만 지정해 주면 알아서 균등분배 수행

In [59]:
data = np.random.randn(1000)
data

array([ 1.30855094, -0.1795363 ,  0.43819842,  0.62439128,  0.20066995,
       -1.06400002, -0.21456048,  0.15783572, -0.69425238, -0.43162392,
        0.88354497, -0.44411045,  1.70309434,  0.91975934,  1.64717624,
        0.34083714,  0.05174917, -1.54058968, -0.4464384 ,  0.56840779,
       -0.54552677, -0.1077738 , -1.56803082, -0.73145512, -0.74489842,
        0.0945617 ,  0.45501831, -0.63333548, -0.69232011,  0.35704707,
       -0.48210368, -0.26597348, -0.51377582, -1.17146603,  0.86739283,
       -1.89892834, -0.47809189, -0.29748159,  0.07631498, -0.08699996,
        1.0890907 , -0.05199775, -0.4533215 ,  0.26553623,  0.42380786,
       -1.65260683, -0.63009022,  0.40389784,  0.71426838,  1.46561554,
       -0.18361714, -0.82268165, -0.48244584,  1.56814687, -1.00472165,
        1.02534212,  0.1913962 , -0.65464182,  0.40219685,  0.12756573,
       -0.3091932 , -1.6395116 ,  0.38344744, -0.23214321, -1.72781736,
       -0.50237515, -0.51393403,  1.55004991,  1.18525831,  0.2069141 ,
       -0.05159653, -1.36828056,  0.17251303,  0.84312081,  0.35812482,
        0.65423195,  0.7429138 ,  1.46125041, -0.97588962,  0.00969781,
        0.46060982, -1.42513443,  1.14292475,  0.12067069,  0.04747716,
       -1.05039041, -0.5761484 ,  0.56321529,  0.45401381, -0.65008743,
       -1.6703044 ,  0.1740758 ,  0.17825705, -1.57913066, -0.75145648,
        0.15219936,  0.19643461, -0.14609124,  0.79680305, -2.33715661,
        2.15172841,  0.42743212,  1.08719169, -0.66264234,  0.82483892,
       -0.22063958,  0.39259435,  0.60487394,  0.86210563,  2.70018964,
        0.00406093,  2.04914185, -0.82387881, -1.03151257,  2.22478553,
       -0.18164558, -0.36103286, -0.16710489, -2.21161331,  0.24660538,
       -0.10773721,  0.2827509 ,  0.46465743, -0.09323704,  0.97589717,
        1.85786217,  0.23330602,  0.59402683,  0.32287815, -0.95818741,
        0.65954956, -0.10150582,  2.17905098,  0.99363863, -0.45820636,
       -0.82933223,  1.42816867, -0.40945994,  1.26997492,  1.23088443,
        0.13332568,  0.02214069,  0.49139247, -0.30725947, -0.87182301,
        0.53519359,  0.3800344 , -1.05823227,  1.69394354, -0.03158112,
       -1.02972013, -2.26557653,  1.299935  ,  0.69918951,  0.08773104,
        0.73494525,  0.92015149,  0.27158069, -0.84755673,  1.40119006,
       -0.27074192,  0.97456471, -0.93202364, -0.32708557,  0.87810194,
       -0.72020172, -0.69338559,  1.16844563,  2.50245395, -0.63374523,
       -0.9562361 ,  0.84778466, -0.33988298, -2.13739973, -2.0395697 ,
        0.28900509, -0.29561781, -1.13453597, -0.20386516,  1.44580406,
        0.59578515,  0.6650859 ,  0.49443232, -1.17624848, -0.61792463,
       -0.2494564 ,  1.15187038,  1.58797948,  0.25684537,  0.16646609,
       -0.49937021, -1.21285419,  0.43052037,  1.14605924,  1.02523709,
        0.50293696,  0.19961036,  0.65477828, -0.49347006,  0.8689858 ,
        0.118841  ,  1.01017092,  0.87009916, -1.47413999, -0.92991938,
        0.27824448,  1.02087753, -1.61444049,  0.12811421, -1.23727643,
       -0.0116086 , -0.02449883,  0.02874468,  0.99010198,  1.57322784,
       -0.08750586,  0.24457211,  0.81920954,  1.34053058,  1.66432524,
        0.26026509,  0.70149814,  0.17023726, -0.20977299,  1.06685081,
        0.50426805,  2.56231733,  0.05980244, -0.79872977, -0.68203215,
       -0.10258568, -0.24673971, -1.82451716, -0.58786891, -0.3855405 ,
       -0.50571652,  1.84529825,  0.84870181, -1.73455079, -0.01802979,
       -0.05271575, -0.10603203,  1.14748643,  0.01743106,  0.39204573,
       -0.4615356 ,  0.48310592, -0.10557991, -0.29280361,  0.27077323,
        0.1641588 , -1.44911164,  0.20792243, -0.91749358,  0.46818796,
        0.09302183,  0.4156019 , -1.00185299,  0.70974013,  1.75386631,
        3.04543555, -0.2106537 ,  1.12829097, -0.17024998,  0.64138626,
       -0.35519931, -1.10824588,  0.64131112,  2.47373265,  0.78936726,
        0.30465691,  0.01536272,  0.65422593, -0.06334195, -0.30248458,
        0.22558264,  0.17908493,  0.80229999,  0.80655243,  1.57511775,
       -0.78874864, -0.59166812,  1.08135365, -0.09680093, -0.77142086,
        2.12603326,  1.06492875,  0.74118451, -0.38185751,  0.98914687,
       -1.0030552 ,  0.84953305,  0.00899845,  0.52630298, -0.41732015,
        0.68496186,  0.98898469,  1.15151578,  1.94450625,  0.63300742,
        0.6691743 ,  1.09229277, -0.9875393 ,  0.01449582,  0.63565187,
        2.10774899,  0.98399255, -0.24736967, -0.55672555, -0.85056263,
       -1.02360609,  1.95152612, -0.98538548,  0.79496743,  0.70013451,
       -1.03154986, -1.44324832,  0.27803671, -0.51905166, -1.96254288,
        1.02044502,  1.4391773 ,  0.87770761, -1.0156704 , -0.06313616,
        0.51459043,  0.45201938,  0.44100951, -0.45312635, -0.48403366,
        0.37845139,  2.18132814,  0.13498025,  1.56354536, -1.82749454,
        0.5912043 ,  0.52455544,  1.42689343,  0.20953664, -1.24597396,
        0.60214647, -0.26205673, -0.95802808, -1.60952335, -0.86083279,
        1.14292976,  1.28129839, -1.13669195, -1.8756842 ,  0.76393282,
       -1.57612884,  1.61696385,  1.01714983, -1.66423745,  0.98053382,
        0.40618371,  1.69476268,  1.17330301, -0.24497241, -0.35148703,
        0.78643208,  0.32891886,  0.66446892, -0.88200806, -1.82428244,
       -0.24122314, -1.45393773,  0.55714991, -0.29579343, -0.96789732,
       -0.72856449,  0.32168442,  0.38035308,  2.14446389,  0.68516174,
        0.48076846,  1.13118827,  0.31305882,  0.36098613, -0.06893725,
        0.11957889,  0.57891483,  1.37935674,  0.28541616, -0.02892959,
        1.13899062,  1.19284777, -0.64848384, -1.64629293, -0.96166357,
       -1.13326738, -0.03255672,  0.22342391, -0.12619135,  1.42037884,
       -1.7484947 ,  1.1133327 , -0.28113136,  0.34189786, -0.74253505,
        1.78082681,  2.28630192, -0.24642361,  0.48362873, -1.36105335,
        0.6494394 , -0.20281877, -1.07371222, -1.26952079, -0.87833912,
       -1.13466625,  0.34660902, -1.4389879 , -1.35223735,  0.59759496,
        0.27373609,  1.63616145, -0.91357243,  0.99238705, -0.86051049,
       -0.80851845,  0.14223519,  0.09186382,  0.01469223, -1.03524866,
        0.74447691,  0.62819439,  0.20666887,  0.62679829,  0.7457536 ,
        0.43768337, -0.44945579,  0.99617107,  0.13806913,  1.48935365,
        0.42738305, -0.84024944, -0.93970946, -2.30011351, -0.09312816,
        0.1466277 , -0.54869903,  1.64205238, -0.41498119, -0.4376572 ,
        0.81730244,  1.77445732, -0.87540675, -0.63047396,  0.28659295,
        0.67628203, -0.05130891,  0.65224933,  0.62863727, -1.13166573,
       -0.13210842, -0.71432766, -0.01042136,  0.5666428 , -0.16272107,
       -1.26270364,  0.74809527, -1.44552226,  0.07484821, -1.25085698,
        1.52673432,  2.5182093 ,  0.56063767, -0.4278014 , -1.09135196,
       -0.51367051, -0.10305429,  0.15183131,  0.53891573, -1.18570333,
       -1.20635206, -0.04161376, -0.29898687,  0.31521642,  0.67963881,
       -0.12392529, -1.12303577,  2.02836244, -0.76660282,  0.15906039,
       -1.71355957, -2.01466446,  1.07495145, -0.46971144, -0.08256961,
        0.43037354, -1.17703096,  0.86067056,  0.21332421,  0.73884978,
        0.18626676,  0.04294097,  0.4617512 , -0.70281138, -0.76221224,
       -0.07849579,  0.31950939, -0.06751093, -0.19742817, -0.22345496,
        1.0132266 ,  0.66566007, -0.31167896,  1.04979651, -1.11352874,
       -0.03518203, -2.15125361, -0.96327827,  0.09855994,  1.17198049,
       -0.45678307,  0.62822771,  1.42260572,  0.70909989, -0.32931141,
       -0.24926391, -0.14846519,  0.6867678 , -0.94756812, -0.70358598,
       -1.2741959 , -0.01793237,  0.4094428 , -0.14924331,  1.69765313,
        0.31087814, -1.4258597 ,  0.96813079,  1.15014944,  0.78741064,
       -0.69075151, -1.01133777, -1.00133351, -0.13248717, -1.91331952,
       -1.21702087, -0.34043815, -1.05362552, -1.55742855, -0.88256104,
       -0.12521854, -0.27489599,  0.60711027,  0.96063628,  0.28676443,
        0.9088541 , -1.38399328, -1.42997554,  1.0368455 ,  0.08472076,
       -0.65607428, -1.63360193, -1.04412243, -0.08515659, -2.32238377,
       -0.23040409, -0.80566748, -0.45563895,  0.48944128, -0.69187174,
        0.40478096, -1.0620703 , -0.65431739, -1.1937142 ,  0.15781828,
       -1.3934774 ,  0.64710228,  0.12036338,  2.00487673,  0.93031768,
       -0.37619482, -0.4862346 ,  0.64616627,  0.53529222,  1.0260566 ,
        0.43500765,  0.66919991,  0.51655818, -0.27931381,  0.73467757,
        0.38781662, -0.27797107,  0.5258547 ,  0.66382789, -1.64361838,
       -0.7642519 , -0.47766349, -0.39569293,  0.34468667, -0.6978211 ,
        1.57997907, -0.38982745,  1.24538932, -1.11762534, -0.50807694,
        0.87824198, -0.48552626, -0.197512  , -1.04747422, -0.39208255,
        0.25964362,  0.00356977,  0.68734993,  0.48234171,  1.12710401,
       -1.14702387, -1.67262002, -1.20041943, -0.68804184, -0.28170941,
       -0.08703176, -1.25058291,  0.78821969,  1.60341069,  0.70290387,
        1.35533316, -0.80142696,  0.52610621,  1.03288575, -1.30676428,
       -0.96886318, -1.69138435,  0.68415917,  0.60348282,  0.36166462,
       -1.18595879, -0.83075325,  1.6608238 ,  0.89614973,  0.09114312,
        1.50507221, -0.04250048, -0.37839317,  0.68504025, -2.70426838,
       -0.37389009, -0.56531577, -0.2063871 ,  1.95177591, -1.26076909,
        1.16910304, -0.31190488, -0.10317751,  1.78363486, -1.58437071,
        0.44603175,  0.19671661, -0.7384938 ,  0.01295639, -0.4861218 ,
        0.27103606, -0.76394306, -1.09520881, -0.76974288,  1.04236119,
       -0.52532745,  0.52847818, -0.15285796, -0.24208129,  0.13438771,
       -0.47333976,  0.22863553,  0.73932858,  0.83200322, -1.40754299,
        0.25275778,  0.13086651, -0.22638731,  0.44712504,  0.36197955,
        0.4776924 , -0.28110184, -1.284736  , -0.17761056, -2.32283748,
       -0.12254171, -1.00130732, -0.474511  , -0.53274324,  0.35719538,
       -1.2274219 , -0.19067292, -0.85766734,  0.73513357,  0.71328597,
        0.57670547, -0.17356309,  1.03749442, -0.84509037,  1.47131919,
        0.38706685,  0.29621874,  0.37375856,  1.36963213,  0.34602904,
        0.22028922, -0.3812236 , -1.43161472, -0.65738881, -1.46274381,
        1.43079164, -0.780466  ,  0.28606677, -0.25717448,  1.25305352,
        0.06832016, -1.21367918, -0.34758984, -1.55075672, -0.38195547,
       -0.31776185, -0.23320153,  1.12103812, -0.54395723,  0.51710325,
        0.63640649,  0.60221385, -1.23395698, -1.42232251,  1.80613379,
        1.3829482 ,  0.17972363,  0.31259064, -0.5873255 , -0.3807237 ,
       -2.14275909,  0.02621277,  0.84157048, -0.12128583,  0.37864094,
       -0.07488594,  0.632405  ,  0.58432342, -0.46919285, -0.80348628,
       -0.0486355 , -1.66240659, -0.45715734,  1.34983735,  0.53927499,
       -0.06156046, -0.2217164 ,  0.06250527, -1.26820939, -1.69147674,
       -0.03808423, -0.75923924,  2.80664993, -0.75549924,  0.77675307,
        1.23156045, -0.71340669,  1.12669517, -0.14171319,  0.61534092,
       -0.61670885,  1.27783457,  0.87567233,  1.57338804, -1.49436135,
       -0.20593542, -0.74570314, -0.35176325,  0.19712194,  1.19533691,
       -0.66570497, -0.65739421, -0.79892621,  0.74001123, -0.91503597,
       -0.51375848, -1.26820941, -0.79633499, -0.16670731,  1.89424032,
        0.29462757, -0.40236034,  1.6415029 , -1.74813262,  0.58409157,
       -0.47877216, -0.82456071, -1.50051159, -0.86176973,  1.71796472,
        0.90946509, -0.15101212,  1.24671109, -0.8926204 ,  0.20147751,
       -0.4307997 ,  0.13405946, -1.06900397, -0.43938818,  0.58399272,
       -0.42328074,  0.5241299 ,  0.84750899,  0.33008191,  0.03954966,
        1.73549757, -0.16946108, -0.58159151, -1.48994081, -0.90992112,
        0.10089618,  0.12527539, -1.57808405, -0.44748761,  1.45525683,
        0.39342887,  0.28937029,  0.33547176, -0.36844036,  2.04184252,
        0.15808494,  3.11185195, -0.23690304,  1.1001117 ,  0.70096182,
        0.73307547, -0.37002263,  0.54317934, -0.56238606,  0.12758659,
        0.69403745,  1.46627973,  0.25499733,  0.26075023, -1.2058817 ,
       -1.34299816,  0.2414492 , -0.28048366,  1.13423199, -0.25599716,
        1.08246992, -0.57702994,  1.28737318, -1.74239944,  1.49169249,
       -1.00113262, -2.49494875,  0.59033763, -0.90659701, -0.10747292,
        0.1052853 ,  0.90173823, -1.38541405, -1.20425529,  1.11879725,
        1.03420728, -1.14004023, -0.52650055, -0.33090599,  1.86946836,
       -0.04146702,  0.95742225, -0.22732788,  0.18061969, -0.31514908,
        1.59346663, -0.0074793 , -0.66179457, -2.34762116, -0.25998532,
        1.09848855,  0.66755717,  1.95647137, -0.55257854, -1.75483923,
        1.54789639,  0.03493287, -0.27751784, -0.198487  , -0.87098264,
        1.54012744,  0.98160516,  0.61251098,  0.18860569,  0.49352329,
       -2.20624277,  0.43218284,  0.37188579, -2.13789423, -0.79605749,
        0.85173057,  0.67409398, -0.51594696, -0.7834588 ,  0.45903578,
        0.98344412, -0.44968513, -0.50196338, -1.08924627, -0.4850258 ,
       -0.19370369,  0.69724987, -0.36513231,  1.31902384, -0.87370025,
        0.27044116,  0.93854448,  0.20339007, -1.63515452, -0.01264384,
       -0.23090871, -0.19609835, -0.17583224,  0.42869794,  2.45666486,
        1.0669552 ,  0.65304558,  1.26479364, -0.3676605 , -0.04900553,
       -0.44176074,  0.87321085, -0.51491572,  1.495109  ,  0.69519484,
        0.59701016, -1.16979962,  0.83047504, -0.9546583 ,  0.76570083,
        0.90309393, -0.32220346, -0.19985898, -0.798354  ,  0.59462928,
       -0.29881893, -0.69404849, -0.98155996, -0.99484206, -0.08470741,
        1.36130199, -0.668318  , -0.59775816,  0.33322479, -1.18916096,
       -0.21106482,  1.82250119, -1.11029144, -0.52542691, -1.2439441 ,
        0.25052812,  0.25928084,  0.32925444, -0.08480819,  1.62407522,
       -0.40548269, -0.18166197, -1.07243555, -2.02109095, -0.29382857,
        0.24294565, -0.85020229,  0.30871295,  0.60161611,  1.33789657,
       -0.3071647 ,  0.58629591, -0.33785156, -0.28255685, -0.77386147,
       -2.42817069,  1.09069597, -0.99013532,  0.69208723, -0.03474805,
       -0.53846561, -0.36186064,  0.09664957,  0.816858  , -0.29999274,
       -0.40007587,  1.25481797,  0.01194422,  0.89705159,  0.35834145,
        0.38028117,  0.46488538,  0.40288577,  1.49648537,  1.70094047,
       -0.73593269, -0.37192911,  0.74171512, -1.02083487,  0.13619664,
       -0.12770062, -1.01223932, -0.73453709, -2.11384933,  0.82756543])

In [60]:
pd.qcut(data, 4)

[(0.668, 3.112], (-0.631, 0.015], (0.015, 0.668], (0.015, 0.668], (0.015, 0.668], ..., (-0.631, 0.015], (-2.705, -0.631], (-2.705, -0.631], (-2.705, -0.631], (0.668, 3.112]]
Length: 1000
Categories (4, interval[float64]): [(-2.705, -0.631] < (-0.631, 0.015] < (0.015, 0.668] < (0.668, 3.112]]

In [64]:
pd.value_counts(pd.qcut(data, 4))

(0.668, 3.112]      250
(0.015, 0.668]      250
(-0.631, 0.015]     250
(-2.705, -0.631]    250
dtype: int64

- pd.cut 대신 pd.qcut이란 메서드도 있음
- pd.cut은 값 기준으로 데이터를 나누는 반면, pd.qcut은 수량 기준으로 데이터를 나눔
- pd.cut은 *표본* 변위치 기반, pd.qcut은 *표준* 변위치 사용

In [65]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(1.246, 3.112], (-1.194, 0.015], (0.015, 1.246], (0.015, 1.246], (0.015, 1.246], ..., (-1.194, 0.015], (-1.194, 0.015], (-1.194, 0.015], (-2.705, -1.194], (0.015, 1.246]]
Length: 1000
Categories (4, interval[float64]): [(-2.705, -1.194] < (-1.194, 0.015] < (0.015, 1.246] < (1.246, 3.112]]

- qcut에서 0~1까지 변위치 지정 가능
___
## 6. 특이값 찾아내고 제외하기

In [68]:
np.random.seed(12345)
data = DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [70]:
col = data[3]
col[np.abs(col)>3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

- N(0,1)에서 3이 넘는 값은 이상치로 판정

In [76]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

- 조건에 부합하는 로우(값) 찾는데 any 메서드 사용

In [80]:
data[np.abs(data)>3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

- np.sign 함수는 특정 값을 1 또는 -1로 반환
- np.sign에 3을 곱해 abs(3) 초과 값들을 abs(3)으로 상한치 부여
___
## 7. 치환과 임의 샘플링

In [81]:
df = DataFrame(np.arange(5*4).reshape(5,4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
sampler = np.random.permutation(5)
sampler

array([1, 0, 2, 3, 4])

In [83]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [95]:
df.take(sampler[:3], axis=1)

    1   0   2
0   1   0   2
1   5   4   6
2   9   8  10
3  13  12  14
4  17  16  18

- np.random.permutation은 지정 값 만큼의 길이로 이루어진 랜덤 정수 배열을 생성
- 이를 활용해서 take 함수에서 사용 가능

In [97]:
df.take(np.random.permutation(len(df)))

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

In [98]:
bag = np.array([5, 7, -1, 6, 4])
sampler = np.random.randint(0, len(bag), size = 10)
sampler

array([4, 4, 2, 2, 2, 0, 3, 0, 4, 1])

In [100]:
draws = bag.take(sampler)
draws

array([ 4,  4, -1, -1, -1,  5,  6,  5,  4,  7])

- 표본생성에 randint, randn 등의 함수 사용 가능
___
## 8. 표시자/더미 변수

In [101]:
df = DataFrame({'key': list('bbacab'),
               'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [102]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

- get_dummies 함수로 factor를 더미변수화함

In [103]:
dummies = pd.get_dummies(df['key'], prefix= 'key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [116]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

- prefix 인자로 접두어 추가 가능
- join 함수로 열 병합

___
### MovieLens 데이터로 복수의 카테고리 더미변수화 연습

In [126]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('d:/git/Repository/Jupyter/Python_for_DA/data/movielens/movies.dat', sep = '::',
                      header = None, names = mnames)
movies[:10]

D:\Programming\anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [127]:
genre_iter = (set(x.split('|')) for x in movies.genres)
genre_iter

In [129]:
genres = sorted(set.union(*genre_iter))
genres

['Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western']

In [134]:
dummies = DataFrame(np.zeros((len(movies), len(genres))), columns = genres)
dummies.head()

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [135]:
for i, gen in enumerate(movies.genres):
    dummies.ix[i, gen.split('|')] = 1

D:\Programming\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [138]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.head()

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0.0,0.0,1.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0